export default {
  name: {
    empty: "Введіть ім'я користувача",
    exists: "Ім'я користувача вже використовується",
  },
  email: {
    empty: 'Введіть електронну пошту',
    type: 'Введіть дійсний e-mail',
    exists: 'E-mail вже використовується',
  },
  password: {
    empty: 'Введіть пароль',
  },
  confirmPassword: {
    empty: 'Введіть підтвердження пароля',
    notMatch: 'Паролі не збігаються',
  },
  phone: {
    empty: 'Введіть номер телефону',
    format: 'Не правильний формат номера телефону',
  },
  role: { enum: 'Виберіть роль зі списку' },
  spec: { enum: 'Виберіть спеціальність зі списку' },
  lang: { enum: 'Виберіть мову зі списку' },
  avatar: { empty: "Аватар обов'язковий" },

  notFound: 'Користувача не знайдено',
  wrongData: 'Неправильний логін або пароль',
  forbidden: 'У вас немає доступу',
  forbiddenParams: 'У вас немає доступу до цього параметру',

  specList: {
    therapist: 'терапевта',
    dentist: 'стоматолога',
  },
};
